#ตัวดำเนินการเปรียบเทียบ

# น่าข้อมูลอย่างน้อย 2 ค่ามาเปรียบเทียบกัน

# ชนิดข้อมูลเหมือนกัน

# ค่าดอบ 2 ค่าตอบ => จริง / เท็จ

x,y = 5,7

print("ค่า x มากกว่า y หรือไม่ ? : ",x>y)
print("ค่า x น้อยกว่า y หรือไม่ ? :", x<y)
print("ค่า x เท่ากับ y หรือไม่",x==y)
print("ค่า x ไม่เท่ากัน y หรือไม่",x!=y)
print("ค่า x มากกว่าหรือเท่ากับ y หรือไม่",x>=y)
print("ค่า x น้อยกว่าหรือเท่ากับ y หรือไม่",x<=y)
#สามสารถนำผลจากตัวดำเนินการมาใช้คำสั่งprintดียวกัน
print(x+y,x-y)
#compoud assigment
x+=5
x=x+5
y+=5
print(y)
print(x)